/*
Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
a = 5; b = 7 -> max = 7
a = 2 b = 10 -> max = 10
a = -9 b = -3 -> max = -3 
*/

/*
Console.WriteLine("Введите два числа по очереди.");
Console.WriteLine("");
Console.WriteLine("Вводите первое число:");
int numberA = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Вводите второе число:");
int numberB = Convert.ToInt32(Console.ReadLine());

if (numberA == numberB)
{
    Console.WriteLine($"Оба числа равны: {numberA} !");
}
else
{
    if (numberA > numberB)
    {
        Console.WriteLine($"Число {numberA} больше!");
    }
    else
    {
        Console.WriteLine($"Число {numberB} больше!");
    }
}
*/

/*
Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
2, 3, 7 -> 7
44 5 78 -> 78
22 3 9 -> 22
*/

/*
Console.WriteLine("Введите три числа по очереди.");
Console.WriteLine("");
Console.WriteLine("Вводите первое число:");
int numberA = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Вводите второе число:");
int numberB = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Вводите третье число:");
int numberC = Convert.ToInt32(Console.ReadLine());
int bigest = 0;

if (numberA > numberB)
{
    bigest = numberA;
}
if (numberB > bigest)
{
    bigest = numberB;
}
if (numberC > bigest)
{
    bigest = numberC;
}

Console.WriteLine($"Самое большое число: {bigest} !");
*/


/*
Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
4 -> да
-3 -> нет
7 -> нет
*/

/*
Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
5 -> 2, 4
8 -> 2, 4, 6, 8
*/

